Revit 2027 API
ColorFillSchemeEntry.SetDoubleValue Method
 Sets new Double value of entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDoubleValue(
	double value
)
Public Sub SetDoubleValue (
	value As Double
)
public:
void SetDoubleValue(
	double value
)
member SetDoubleValue :
        value : float -> unit
Parameters
value Double
Exceptions
Exception | Condition
InvalidOperationException |  The entry has different storage type with Double, or value is not finite.
Remarks
 You should only use this method if the StorageType property reports the type of the entry as a Double.
See Also
Reference
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace